# Índice <a name="Contents"></a>
1. [Importando bibliotecas](#import)
2. [Merge (left, right, inner, full)](#merge)
    1. [Construindo dataframes](#data_1)
    2. [Left join 1](#left_1)
    3. [Right join 1](#right_1)
    4. [Left join 2](#left_2)
    5. [Right join 2](#right_2)
    6. [Inner join](#inner)
    7. [Full outer join](#full)
3. [Concat](#concat)
    1. [Construindo dataframes](#data_2)
    2. [Concat com axis = 0](#axis_0)
    3. [Concat com axis = 0 e ignore_index=True](#index_true)
    4. [Concat com axis = 1](#axis_1)    
4. [Append](#append)

# 1. Importando bibliotecas <a name="import"></a>

<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [3]:
import pandas as pd

# 2. Merge (left, right, inner, full) <a name="merge"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

## 2.1 Construindo dataframes <a name="data_1"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [31]:
df1 = pd.DataFrame({
    'ID': ['Cliente_1', 'Cliente_2', 'Cliente_3', 'Cliente_4'],
    'Sexo': ['M', 'F', 'F', 'M'],
    'Idade': [27, 30, 24, 35],
    'Salario': [5000, 7000, 2700, 6500]
})
df1

          ID Sexo  Idade  Salario
0  Cliente_1    M     27     5000
1  Cliente_2    F     30     7000
2  Cliente_3    F     24     2700
3  Cliente_4    M     35     6500

In [32]:
df2 = pd.DataFrame({
    'ID': ['Cliente_1', 'Cliente_2', 'Cliente_3', 'Cliente_4'],
    'Compras_M1': [0, 200, 300, 1000],
    'Compras_M2': [1000, 800, 300, 2000]
})
df2

          ID  Compras_M1  Compras_M2
0  Cliente_1           0        1000
1  Cliente_2         200         800
2  Cliente_3         300         300
3  Cliente_4        1000        2000

## 2.2 Left join 1 <a name="left_1"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [40]:
df1.merge(df2, on='ID', how='left')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M     27     5000           0        1000
1  Cliente_2    F     30     7000         200         800
2  Cliente_3    F     24     2700         300         300
3  Cliente_4    M     35     6500        1000        2000

## 2.3 Right join 1 <a name="right_1"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [34]:
df1.merge(df2, on='ID', how='right')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M     27     5000           0        1000
1  Cliente_2    F     30     7000         200         800
2  Cliente_3    F     24     2700         300         300
3  Cliente_4    M     35     6500        1000        2000

## 2.4 Left join 2 <a name="left_2"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [35]:
df2_sem4 = df2[df2['ID'] != 'Cliente_4']
df2_sem4

          ID  Compras_M1  Compras_M2
0  Cliente_1           0        1000
1  Cliente_2         200         800
2  Cliente_3         300         300

In [36]:
df1.merge(df2_sem4, on='ID', how='left')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M     27     5000         0.0      1000.0
1  Cliente_2    F     30     7000       200.0       800.0
2  Cliente_3    F     24     2700       300.0       300.0
3  Cliente_4    M     35     6500         NaN         NaN

## 2.5 Right join 2<a name="right_2"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [37]:
df1.merge(df2_sem4, on='ID', how='right')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M     27     5000           0        1000
1  Cliente_2    F     30     7000         200         800
2  Cliente_3    F     24     2700         300         300

## 2.6 Inner join<a name="inner"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [38]:
df1_sem3 = df1[df1['ID'] != 'Cliente_3']
df1_sem3

          ID Sexo  Idade  Salario
0  Cliente_1    M     27     5000
1  Cliente_2    F     30     7000
3  Cliente_4    M     35     6500

In [39]:
df1_sem3.merge(df2_sem4, on='ID', how='inner')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M     27     5000           0        1000
1  Cliente_2    F     30     7000         200         800

## 2.7 Full outer join <a name="full"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [41]:
df1_sem3.merge(df2_sem4, on='ID', how='outer')

          ID Sexo  Idade  Salario  Compras_M1  Compras_M2
0  Cliente_1    M   27.0   5000.0         0.0      1000.0
1  Cliente_2    F   30.0   7000.0       200.0       800.0
2  Cliente_4    M   35.0   6500.0         NaN         NaN
3  Cliente_3  NaN    NaN      NaN       300.0       300.0

# 3. Concat <a name="concat"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

## 3.1 Construindo dataframes <a name="data_2"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [21]:
df1 = pd.DataFrame({
    'ID': ['Cliente_1', 'Cliente_2'],
    'Sexo': ['M', 'F'],
    'Idade': [27, 30]
})
df1

          ID Sexo  Idade
0  Cliente_1    M     27
1  Cliente_2    F     30

In [22]:
df2 = pd.DataFrame({
    'ID': ['Cliente_3', 'Cliente_4'],
    'Sexo': ['F', 'M'],
    'Idade': [24, 35]
})
df2

          ID Sexo  Idade
0  Cliente_3    F     24
1  Cliente_4    M     35

In [23]:
df3 = pd.DataFrame({
    'ID': ['Cliente_5', 'Cliente_6'],
    'Sexo': ['M', 'F'],
    'Idade': [40, 50]
})
df3

          ID Sexo  Idade
0  Cliente_5    M     40
1  Cliente_6    F     50

## 3.2 Concat com ``axis = 0`` <a name="axis_0"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [27]:
pd.concat([df1, df2, df3], axis = 0)

          ID Sexo  Idade
0  Cliente_1    M     27
1  Cliente_2    F     30
0  Cliente_3    F     24
1  Cliente_4    M     35
0  Cliente_5    M     40
1  Cliente_6    F     50

## 3.3 Concat com ``axis = 0`` e ``ignore_index=True`` <a name="index_true"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [28]:
pd.concat([df1, df2, df3], axis = 0, ignore_index=True)

          ID Sexo  Idade
0  Cliente_1    M     27
1  Cliente_2    F     30
2  Cliente_3    F     24
3  Cliente_4    M     35
4  Cliente_5    M     40
5  Cliente_6    F     50

## 3.4 Concat com ``axis = 1``  <a name="axis_1"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [26]:
pd.concat([df1, df2, df3], axis = 1)

          ID Sexo  Idade         ID Sexo  Idade         ID Sexo  Idade
0  Cliente_1    M     27  Cliente_3    F     24  Cliente_5    M     40
1  Cliente_2    F     30  Cliente_4    M     35  Cliente_6    F     50

# 4. Append <a name="append"></a>
<div style="text-align: right"
     
[Voltar ao índice](#Contents)

In [29]:
df1.append([df2, df3])

          ID Sexo  Idade
0  Cliente_1    M     27
1  Cliente_2    F     30
0  Cliente_3    F     24
1  Cliente_4    M     35
0  Cliente_5    M     40
1  Cliente_6    F     50